In [1]:
import pandas as pd

In [2]:
data = { 'Name':["John","Anna", "Peter", "Linda" ],
         'Location':["New York","Paris", "Berlin", "London"],
         'Age':[24,13,53,33]}

In [4]:
data = pd.DataFrame(data)

In [5]:
data

   Age  Location   Name
0   24  New York   John
1   13     Paris   Anna
2   53    Berlin  Peter
3   33    London  Linda

In [7]:
display(data[data.Age>30])

   Age Location   Name
2   53   Berlin  Peter
3   33   London  Linda

In [8]:
data[data.Age>30]

   Age Location   Name
2   53   Berlin  Peter
3   33   London  Linda

In [9]:
import mglearn

In [10]:
mglearn.plots.plot_scaling()